Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: If a and b are incomparable, and b and c are incomparable, then a and c are also incomparable.
ja: aとbが比較できないならば、そしてbとcが比較できないならば、そのときaとcもまた比較できない。

source: If body has a return value, that value is also used as the return value for the withExtendedLifetime(_:_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithExtendedLifetime(_:_:)メソッドの戻り値としても使われます。

source: If body has a return value, that value is also used as the return value for the withoutActuallyEscaping(_:do:) function.
ja: bodyが戻り値を持つならば、その値はまたwithoutActuallyEscaping(_:do:)関数の戻り値としても使われます。

source: If element is not found in the collection, returns nil.
ja: elementがコレクションの中に見つけられないならば、nilを返します。

source: If element is not found in the collection, this method returns nil.
ja: elementがコレクションの中に見つけられないならば、このメソッドはnilを返します。

source: If key already exists in the dictionary, value replaces the existing associated value.
ja: keyが既に辞書の中に存在するならば、valueが既存の結び付けられる値に取って代わります。

source: If pointer is nil, the result is 0.
ja: pointerがnilならば、結果は0です。

source: If rhs is outside the range 0...bitWidth, it is masked to produce a value within that range.
ja: rhsが範囲0...bitWidthの外側ならば、それはマスクされてその範囲内の値を生み出します。

source: If text has invalid characters or is in an invalid format, the result is nil.
ja: textが無効な文字を持つまたは無効な形式であるならば、結果はnilです。

source: If transform throws an error, the sequence ends.
ja: transformがエラーをスローするならば、そのシーケンスは終わります。

source: If areInIncreasingOrder throws an error during the sort, the elements may be in a different order, but none will be lost.
ja: areInIncreasingOrderがエラーをソートの間にスローするならば、要素は異なる順番になるかもしれません、しかし何１つとしてなくさないでしょう。

source: If distance is positive, this is the same value as the result of distance calls to index(after:).
ja: distanceが正ならば、これはdistanceでindex(after:)を呼び出す結果と同じ値です。

source: If i == endIndex, this method is equivalent to append(_:).
ja: i == endIndexならば、このメソッドはappend(_:)に相当します。

source: If n is positive, this is the same value as the result of n calls to index(after:).
ja: nが正ならば、これはnでindex(after:)を呼び出すの結果と同じ値です。

source: If path can’t be appended, returns nil.
ja: pathが追加できないならば、nilが返ります。

source: If rhs is zero, the result of the division is infinity, with the sign of the result matching the sign of lhs.
ja: rhsがゼロならば、除算の結果は無限大です、結果の符号はlhsの符号と一致します。

source: If source is less than the smallest representable value in this type, the result is the type’s min value.
ja: sourceがこの型の最も小さい表現可能な値より小さいならば、結果はこの型のもつmin値です。

source: If stopOnError is false, the entire iterator will be exhausted.
ja: stopOnErrorがfalseならば、イテレータ全体が使い尽くされることになります。

source: If x is equal to y, returns x.
ja: xがyと等しいならば、xを返します。

source: If x is equal to y, returns y.
ja: xがyと等しいならば、yを返します。

source: If body has a return value, that value is also used as the return value for the withUnsafeBufferPointer(_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithUnsafeBufferPointer(_:)メソッドの戻り値としても使われます。

source: If body has a return value, that value is also used as the return value for the withUnsafeCurrentTask(body:) function.
ja: bodyが戻り値を持つならば、その値はまたwithUnsafeCurrentTask(body:)関数の戻り値としても使われます。

source: If key isn’t already a key of the dictionary, the (key, value) pair is added.
ja: keyがまだこの辞書のキーでないならば、(key, value)ペアが加えられます。

source: If object is nil, the return value is false.
ja: objectがnilならば、戻り値はfalseです。

source: If true, only nonempty subsequences are returned.
ja: trueならば、空でない下位シーケンスだけが返されます。

source: If body has a return value, that value is also used as the return value for the withUnsafeBytes(_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithUnsafeBytes(_:)メソッドの戻り値としても使われます。

source: If body has a return value, that value is also used as the return value for the withUnsafeMutableBufferPointer(_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithUnsafeMutableBufferPointer(_:)メソッドの戻り値としても使われます。

source: If body has a return value, that value is also used as the return value for the withVaList(_:) function.
ja: bodyが戻り値を持つならば、その値はまたwithVaList(_:)関数の戻り値としても使われます。

source: If next never returns nil, the sequence is infinite.
ja: nextが決してnilを返さないならば、 このシーケンスは果てがありません。

source: If possiblePrefix has no elements, the return value is true.
ja: possiblePrefixが１つも要素を持たないならば、戻り値はtrueです。

source: If body has a return value, that value is also used as the return value for the withUnsafeMutableBytes(_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithUnsafeMutableBytes(_:)メソッドの戻り値としても使われます。

source: If distance is negative, this is the same value as the result of abs(distance) calls to index(before:).
ja: distanceが負ならば、これはabs(distance)でindex(before:)を呼び出す結果と同じ値です。

source: If n is negative, this is the same value as the result of -n calls to index(before:).
ja: nが負ならば、これは-nがindex(before:)を呼び出すの結果と同じ値です。

source: If i == endIndex, this method is equivalent to append(contentsOf:).
ja: i == endIndexならば、このメソッドはappend(contentsOf:)に相当します。

source: If transform throws an error, the sequence terminates.
ja: transformがエラーをスローするならば、そのシーケンスは終端します。

source: If x / y is exactly halfway between two integers, q is chosen to be even.
ja: x / yが正確に２つの整数の間の中ほどならば、qは偶数である方を選ばれます。

source: If copy(with:) returns the same array, the instances of NSArray and Array share storage using the same copy-on-write optimization that is used when two instances of Array share storage.
ja: copy(with:)が同じ配列を返すならば、NSArrayとArrayのインスタンスは同じコピーオンライト最適化を使ってストレージを共有します、それはArrayの２つのインスタンスがストレージを共有するとき使う最適化です。

source: If EOF has already been reached when readLine() is called, the result is nil.
ja: readLine()が呼ばれるときEOFがすでに到達されているならば、結果はnilです。

source: If Objective-C code calls a Swift method that throws an error, the error is automatically propagated to the error pointer argument of the bridged Objective-C method.
ja: Objective-Cコードがエラーをスローするスウィフトメソッドを呼ぶならば、そのエラーはブリッジされたObjective-Cメソッドのエラーポインタ引数に自動的に伝達されます。

source: If a type does not support subnormals, x.ulp may be rounded to zero.
ja: ある型がサブノーマルをサポートしないならば、x.ulpはゼロに丸められるかもしれません。

source: If a type’s radix is 2, then for finite nonzero numbers, the significand is in the range 1.0 ..< 2.0.
ja: ある型のもつ基数が２であるならば、そのとき有限の非ゼロの数に対して、仮数は範囲1.0 ..< 2.0の中になります。

source: If all imported members have default values, Swift also provides a default initializer that takes no arguments.
ja: すべてのインポートされたメンバが省略時の値を持つならば、スウィフトもまた引数を取らない省略時のイニシャライザをひとつ提供します。

source: If an onTermination callback is set, when iteration of a AsyncStream is cancelled via task cancellation that callback is invoked.
ja: onTerminationコールバックが設定されるならば、AsyncStreamの反復がタスク取り消し経由で取り消される場合、そのコールバックが発動されます。

source: If an error producing Objective-C method returns a BOOL value to indicate the success or failure of a method call, Swift changes the return type of the function to Void.
ja: エラーを生成しているObjective-CメソッドがBOOL値を返して、メソッド呼び出しの成功または失敗を指し示すならば、スウィフトは関数の戻り型をVoidに変えます。

source: If an object has a stronger notion of identity, it may be appropriate to provide a custom implementation.
ja: あるオブジェクトがより強い同一性概念を持つならば、それはあつらえの実装を提供するのが適切であるかもしれません。

source: If another method is declared with the resulting selector, the method name is not changed.
ja: 結果として生じるセレクタで別のメソッドが宣言されるならば、メソッド名は変更されません。

source: If another part of the app changes myNickname and submits a change request back to the server, the most recently rejected penpal recommendation won't be mistakenly picked up by the change.
ja: アプリの別の部分がmyNicknameを変更するそして変更要請をサーバに提出するとしても、最近拒否した文通友達推薦が、その変更によって間違って拾い上げられることはないでしょう。

source: If both x and y are NaN, or either x or y is a signaling NaN, the result is NaN.
ja: xとyの両方がNaN、またはxまたはyのどちらかがシグナルNaNならば、結果はNaNです。

source: If both values are false, the operator returns false.
ja: 両方の値がfalseならば、演算子はfalseを返します。

source: If calling the closure throws an error, the sequence ends and next() rethrows the error.
ja: クロージャを呼び出すことがエラーをスローするならば、シーケンスは終了します、そしてnext()はそのエラーを再スローします。

source: If calling the predicate closure throws an error, the sequence ends and next() rethrows the error.
ja: 述部クロージャを呼び出すことがエラーをスローするならば、シーケンスは終了します、そしてnext()はそのエラーを再スローします。

source: If either of the values is false, the operator returns false.
ja: 値のどちらかがfalseならば、演算子はfalseを返します。

source: If either this value or other is NaN, the result of this method is false.
ja: この値またはotherのどちらかがNaNならば、このメソッドの結果はfalseです。

source: If included, the exponent is separated by a single character, e or E, and consists of an optional plus or minus sign character and a sequence of decimal digits.
ja: もし含むならば、指数は１つの文字eもしくはEによって区切られます、そして随意のプラスまたはマイナス符号文字と一連の10進の桁から成り立ちます。

source: If included, the exponent is separated by a single character, p or P, and consists of an optional plus or minus sign character and a sequence of decimal digits.
ja: もし含むならば、指数は１つの文字pもしくはPによって区切られます、そして随意のプラスまたはマイナス符号文字と一連の10進の桁から成り立ちます。

source: If necessary, the byte order of this value is reversed from the typical byte order of this integer type.
ja: 必要ならば、この値のバイト順はこの整数型の典型的なバイト順からひっくり返されます。

source: If no elements in the collection match belongsInSecondPartition, the returned index is equal to the collection’s endIndex.
ja: コレクションの中の要素が１つもbelongsInSecondPartitionに一致しないならば、返されるインデックスはコレクションのendIndexと等しいです。

source: If no elements in the collection satisfy the given predicate, returns nil.
ja: コレクションの要素が与えられた述部を満たすことがないならば、nilを返します。

source: If no such storage exists, it is created.
ja: そのようなストレージが存在しないならば、それは作成されます。

source: If no such storage exists, it is first created.
ja: そのようなストレージが存在しないならば、それが最初に作成されます。

source: If not, any value in defaults[greetingKey] will succeed, and if not that, greeting will be set to the non-optional default value, "Greetings!".
ja: そうでないならば、defaults[greetingKey]の中の何らかの値が後を継ぎます、そしてそれもないならば、greetingは非オプショナルの省略時の値、"Greetings!"に設定されます。

source: If stepping from start by stride does not produce end, the last value in the sequence will be one step before going beyond end.
ja: startからstrideだけまたいで越えるならば、endを生成せず、シーケンスの最後の値はendを越える前に一またぎあるでしょう。

source: If the description value is any string other than "true" or "false", the result is nil.
ja: このdescription値が"true"または"false"と違う何らかの文字列ならば、結果はnilです。

source: If the overflow component is false, the partialValue component contains the entire difference.
ja: overflow構成部分がfalseならば、partialValue構成部分は差そのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire product.
ja: overflow構成部分がfalseならば、partialValue構成部分は積そのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire quotient.
ja: overflow構成部分がfalseならば、partialValue構成部分は全体の商を含みます。

source: If the overflow component is false, the partialValue component contains the entire remainder.
ja: overflow構成部分がfalseならば、partialValue構成部分は余りそのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire sum.
ja: overflow構成部分がfalseならば、partialValue構成部分は合計そのままを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains either the truncated quotient or, if the quotient is undefined, the dividend.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こった、そしてpartialValue構成部分は切り詰められた商または、商が未定義ならば、被除数のどちらかを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated product of this value and rhs.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値とrhsの積の切り詰められたものを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated result of rhs subtracted from this value.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値からrhsを減算した結果の切り詰められたもの含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated sum of this value and rhs.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値とrhsの合計の切り詰められたものを含みます。

source: If the overflow component is true, an overflow occurred during division and the partialValue component contains either the entire remainder or, if the remainder is undefined, the dividend.
ja: overflow構成部分がtrueであるならば、除算の間にオーバーフローが起こった、そしてpartialValue構成部分は余りそのまままたは、余りが未定義ならば、被除数のどちらかを含みます。

source: If the Objective-C generic parameterization specifies class or protocols qualifications, the imported Swift declaration has a constraint that requires that type to be a subclass of the specified class or to conform to the specified protocol.
ja: Objective-C総称体パラメータ化がクラスまたはプロトコル適格を指定するならば、インポートされたスウィフト宣言はある制約を持ちます、それがその型に要求するのは、指定されたクラスのサブクラスであることまたは指定されたプロトコルに準拠することです。

source: If the Objective-C method’s error parameter is also its first parameter, Swift attempts to simplify the method name further, by removing the WithError or AndReturnError suffix, if present, from the first part of the selector.
ja: Objective-Cメソッドのerrorパラメーターがまたそれの最初のパラメーターでもあるならば、スウィフトはメソッド名をいっそう単純化することをWithErrorまたはAndReturnError接尾辞を、もしあるならば、セレクタの最初の部分から取り除くことによって試みます。

source: If the array is empty, endIndex is equal to startIndex.
ja: 配列が空ならば、endIndexはstartIndexと等しいです。

source: If the array is empty, startIndex is equal to endIndex.
ja: 配列が空ならば、startIndexはendIndexと等しいです。

source: If the array is empty, these properties are nil.
ja: その配列が空であるならば、これらのプロパティはnilです。

source: If the array’s Element type is a struct or enumeration, Array and ContiguousArray should have similar efficiency.
ja: 配列のElement型が構造体または列挙であるならば、ArrayとContiguousArrayは同じような効率を持つはずです。

source: If the asynchronous sequence is empty, this method returns true.
ja: 非同期シーケンスが空ならば、このメソッドはtrueを返します。

source: If the base iterator returns nil, indicating the end of the sequence, this iterator returns nil.
ja: 基底イテレータがnilを返して、シーケンスの終わりを指し示すならば、このイテレータはnilを返します。

source: If the bit width of the shifted integer type is a power of two, masking is performed using a bitmask; otherwise, masking is performed using a modulo operation.
ja: シフトされる整数型のビット幅が２の冪ならば、マスクはビットマスクを使って実行されます；そうでなければ、マスクはモジュロ演算を使って実行されます。

source: If the call to this method simply appends the contents of newElements to the array, this method is equivalent to append(contentsOf:).
ja: このメソッドへの呼び出しが単にnewElementsの内容を配列に追加するだけならば、このメソッドはappend(contentsOf:)と等しいです。

source: If the call to this method simply appends the contents of newElements to the collection, the complexity is O(m).
ja: このメソッドへの呼び出しが単にnewElementsの内容をコレクションに追加するだけならば、計算量はO(m)です。

source: If the character does not represent a hexadecimal digit, the value of this property is nil.
ja: 文字が16進法桁を表さないならば、このプロパティの値はnilです。

source: If the closure has a return value, that value is also used as the return value of the withUnsafeBytes(of:_:) function.
ja: クロージャが戻り値を持つならば、その値はまたwithUnsafeBytes(of:_:)関数の戻り値としても使われます。

source: If the closure has a return value, that value is also used as the return value of the withUnsafeMutableBytes(of:_:) function.
ja: クロージャが戻り値を持つならば、その値はまたwithUnsafeMutableBytes(of:_:)関数の戻り値としても使われます。

source: If the closure has a return value, that value is also used as the return value of the withUnsafeMutablePointer(to:_:) function.
ja: クロージャが戻り値を持つならば、その値はまたwithUnsafeMutablePointer(to:_:)関数の戻り値としても使われます。

source: If the closure has a return value, that value is also used as the return value of the withUnsafePointer(to:_:) function.
ja: クロージャが戻り値を持つならば、その値はまたwithUnsafePointer(to:_:)関数の戻り値としても使われます。

source: If the closure returns true, next() returns the received element; otherwise it awaits the next element from the base iterator.
ja: クロージャがtrueを返すならば、next()は受け取った要素を返します；そうでなければそれは次の要素を基底イテレータから待ちます。

source: If the closure you provide throws an error, the sequence produces no elements and throws the error instead.
ja: あなたが提供するクロージャがエラーをスローするならば、シーケンスは要素を全く生み出しません、そして代わりにエラーをスローします。

source: If the collection does not support an internal representation in a form of contiguous storage, body is not called and nil is returned.
ja: コレクションがある内部表現を隣接ストレージの形式でサポートしないならば、bodyは呼び出されません、そしてnilが返されます。

source: If the collection does not support an internal representation in a form of mutable contiguous storage, body is not called and nil is returned.
ja: コレクションがある内部表現を可変の隣接ストレージの形式でサポートしないならば、bodyは呼び出されません、そしてnilが返されます。

source: If the collection is empty, endIndex is equal to startIndex.
ja: コレクションが空ならば、endIndexはstartIndexと等しいです。

source: If the collection is empty, startIndex is equal to endIndex.
ja: コレクションが空ならば、startIndexはendIndexと等しいです。

source: If the collection is empty, the method returns nil.
ja: コレクションが空ならば、このメソッドはnilを返します。

source: If the collection is empty, the value of this property is nil.
ja: コレクションが空であるならば、このプロパティはnilです。

source: If the consistency of an app's models is stored on a server, you can model records as structures with identifiers.
ja: あるアプリの持つモデルの一貫性がサーバ上に格納されるならば、あなたはレコードを、識別子を使って構造体としてモデル化できます。

source: If the continuation has already been resumed through this object, then the attempt to resume the continuation will trap.
ja: 継続が既にこのオブジェクトを通して再開されてしまったならば、そのとき継続を再開する試みはトラップするでしょう。

source: If the count passed to prefix(_:) exceeds the number of elements in the base sequence, the result contains all of the elements in the sequence.
ja: prefix(_:)に渡されるcountが基底シーケンスの中の要素の数を越えるならば、結果はそのシーケンスの要素のすべてを含みます。

source: If the dictionary doesn’t contain the key, the key and value are added as a new key-value pair.
ja: 辞書がそのキーを含まないならば、キーと値は新しいキー値ペアとして加えられます。

source: If the dictionary uses String or Int keys, the contents are encoded in a keyed container.
ja: 辞書がStringまたはIntキーを使うならば、内容はキー付けされるコンテナの中にエンコードされます。

source: If the dictionary wraps a bridged NSDictionary, the performance is unspecified.
ja: 辞書が、ブリッジされたNSDictionaryをラップするならば、性能は不特定です。

source: If the dynamic type of obj doesn’t implement a getIntegerValue() method, the system returns a runtime error when you initialize certainValue.
ja: objの動的型がgetIntegerValue()メソッドを実装しないならば、システムは実行時エラーをあなたがcertainValueを初期化する時に返します。

source: If the elements in an array are instances of a class, the semantics are the same, though they might appear different at first.
ja: 配列に属する要素らがクラスのインスタンスらであるならば、意味論は同じです、にもかかわらずそれらは最初は異なっているように思うかもしれません。

source: If the given floating-point value cannot be represented exactly, the result is nil.
ja: 与えられた浮動小数点値が正確に表現できないならば、結果はnilです。

source: If the given integer cannot be represented exactly, the result is nil.
ja: 与えられた整数が正確に表現できないならば、結果はnilです。

source: If the given key is found in the dictionary, this method returns an index into the dictionary that corresponds with the key-value pair.
ja: 与えられたキーがこの辞書の中に見つかるならば、このメソッドは辞書の中へのあるインデックスを返し、それがそのキー値ペアに対応するものです。

source: If the given key is not present in the dictionary, this method adds the key-value pair and returns nil.
ja: 与えられたキーがこの辞書の中に存在しないならば、このメソッドはそのキー値ペアを加えてnilを返します。

source: If the instance passed as object is being accessed by multiple threads simultaneously, this function may still return true.
ja: objectとして渡されるインスタンスが複数のスレッドによって同時にアクセスされる場合、この関数は依然としてtrueを返します。

source: If the iterator needs to clean up on cancellation, it can do so after checking for cancellation as described above, or in deinit if it’s a reference type.
ja: イテレータが取り消しに関して片付けを必要とするならば、それはそうすることが可能です、上で記述されるように取り消しを確認した後に、またはそれが参照型であるならばdeinitにおいて。

source: If the key is found in the dictionary, this method returns the key’s associated value.
ja: キーが辞書の中に見つけられるならば、このメソッドはそのキーの結び付けられる値を返します。

source: If the key isn’t found in the dictionary, removeValue(forKey:) returns nil.
ja: キーが辞書の中に見つけられないならば、removeValue(forKey:)はnilを返します。

source: If the last non-block parameter of an Objective-C method is of type NSError **, Swift replaces it with the throws keyword, to indicate that the method can throw an error.
ja: Objective-Cメソッドの最後の非ブロックパラメーターが型NSError **ならば、スウィフトはそれをthrowsキーワードで置き換えて、そのメソッドがエラーをスローできることを示します。

source: If the maximum length exceeds the number of elements in the collection, the result contains all the elements in the collection.
ja: 最大長がコレクションの要素の数を越えるならば、結果はコレクションの要素すべてを含みます。

source: If the maximum length exceeds the number of elements in the collection, the result contains the entire collection.
ja: 最大長がコレクションの要素の数を越えるならば、結果はコレクション全体を含みます。

source: If the maximum length exceeds the number of elements in the sequence, the result contains all the elements in the sequence.
ja: 最大長がシーケンスの要素の数を越えるならば、結果はシーケンスの要素すべてを含みます。

source: If the method calls its completion handler with a nullable parameter, the asynchronous version in Swift is marked with the @discardableResult attribute.
ja: メソッドがそれの完了ハンドラをヌル可能パラメータで呼び出すならば、Swiftでの非同期版は、@discardableResult属性で印されます。

source: If the method has more than one parameter, and the last parameter's selector piece is one of the following, Swift imports the method as an asynchronous method:
ja: メソッドが１つ以上のパラメータを持つ、そして最後のパラメータの持つセレクタ部分が以下の１つであるならば、Swiftはそのメソッドをある非同期メソッドとしてインポートします：

source: If the method has only one parameter and its selector ends with one of the following suffixes, Swift imports the method as an asynchronous method:
ja: メソッドがただ１つのパラメータを持つ、そしてそれのセレクタが以下の接尾辞の１つで終わるならば、Swiftはそのメソッドをある非同期メソッドとしてインポートします：

source: If the name begins with a number, the first digit is replaced with an underscore.
ja: 名前が数字で始まるならば、最初の数字はアンダースコアで置き換えられます。

source: If the number of elements to drop exceeds the number of elements in the collection, the result is an empty subsequence.
ja: 省かれることになる要素の数がコレクションの要素の数を越えるならば、結果は空の下位シーケンスです。

source: If the number of elements to drop exceeds the number of elements in the sequence, the result is an empty sequence.
ja: 取り除く要素の数がシーケンスの要素数を越えるならば、結果は空のシーケンスです。

source: If the passed instance conforms to CustomStringConvertible, the String(describing:) initializer and the print(_:) function use the instance’s custom description property.
ja: 渡されたインスタンスがCustomStringConvertibleに準拠するならば、String(describing:)イニシャライザとprint(_:)関数はそのインスタンスのあつらえのdescriptionプロパティを使います。

source: If the payload contains any other characters, it is ignored.
ja: ペイロードが何か他の文字を含むならば、それは無視されます。

source: If the predicate hasn’t failed yet, this method gets the next element from the base sequence and calls the predicate with it.
ja: 述部がまだ失敗しないならば、このメソッドは次の要素を基底シーケンスから取得します、そして述部をそれとともに呼び出します。

source: If the predicate hasn’t yet failed, this method gets the next element from the base sequence and calls the predicate with it.
ja: 述部がまだ失敗しないならば、このメソッドは次の要素を基底シーケンスから取得します、そして述部をそれとともに呼び出します。

source: If the predicate throws an error, the sequence contains only values produced prior to the error.
ja: 述部がエラーをスローするならば、シーケンスはエラーより前に生み出された値のみを含みます。

source: If the quotient is too large to represent in the type, a runtime error may occur.
ja: 商がこの型において表すのに大きすぎるならば、実行時エラーが起こるかもしれません。

source: If the quotient of dividing dividend by this value is too large to represent in the type, a runtime error may occur.
ja: dividendをこの値で除算した商がこの型で表すのに大きすぎるならば、実行時エラーが起こります。

source: If the result of advancing by n is not representable as a value of this type, then a runtime error may occur.
ja: nだけ前進する結果がこの型の値として表現可能でないならば、実行時エラーが起こるでしょう。

source: If the selector ends with Asynchronously, that suffix is removed.
ja: セレクタがAsynchronouslyで終わるならば、その接尾辞は取り除かれます。

source: If the selector starts with get, that prefix is removed and leading initialisms are converted to lowercase.
ja: セレクタがgetで始まるならば、その接頭辞は取り除かれます、そして先導している頭文字それらは小文字に変換されます。

source: If the sequence contains any values, the first one is start.
ja: シーケンスが何らかの値を含むならば、最初のものはstartです。

source: If the sequence has no elements, nextPartialResult is never executed and initialResult is the result of the call to reduce(_:_:).
ja: シーケンスが１つも要素を持たないならば、nextPartialResultは決して実行されません、そしてinitialResultはreduce(_:_:)への呼び出しの結果となります。

source: If the sequence has no elements, updateAccumulatingResult is never executed and initialResult is the result of the call to reduce(into:_:).
ja: シーケンスが１つも要素を持たないならば、updateAccumulatingResultは決して実行されません、そしてinitialResultはreduce(into:_:)への呼び出しの結果となります。

source: If the sequence has no elements, returns nil.
ja: シーケンスが要素を持たないならば、nilを返します。
